---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException
source: html/a3ed0157-0a46-0b62-62db-08112e1645bd.htm
---
# Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException

The exception that is thrown when there is a model with the same name already exist.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerModelAlreadyExistsException : RevitServerException
```